/*******************************************************************************
*                              APPLICATION CODE
*
* (c)Copyright Guangdong ENECO POWER Science And Technology Co., Ltd.2015-2018.
*
*      All rights reserved.  Protected by international copyright laws.
*       Knowledge of the source code may NOT be used without authorization.
********************************************************************************
*/

/**
 *******************************************************************************
 * @file      bsp.c
 * @author    FanJun
 * @version   V1.0.0
 * @date      11-June-2018
 * @brief     program entry
 * @attention none.
 *******************************************************************************
 */

/*
********************************************************************************
*                              INCLUDE FILES
********************************************************************************
*/
#include "bsp.h"

/*
********************************************************************************
*                             MACRO DEFINITIONS
********************************************************************************
*/

/*
********************************************************************************
*                          OS-RELATED    VARIABLES
********************************************************************************
*/

/*
********************************************************************************
*                             FUNCTION PROTOTYPES
********************************************************************************
*/

/*
********************************************************************************
*                              LOCAL VARIABLES
********************************************************************************
*/

/*
********************************************************************************
*                               GLOBAL VARIABLES
********************************************************************************
*/



/*
********************************************************************************
*                              FUNCTION DEFINITION
********************************************************************************
*/

/**
 * @brief :	板级驱动初始化.
 * @param :	none.
 * @retval:	none.
 */

void Bsp_Init(void)
{
    Write_Through();                					//Cahce强制透写
    MPU_Memory_Protection();        					//保护相关存储区域
    Cache_Enable();                 					//打开L1-Cache

    HAL_Init();                     					//初始化HAL库

    Stm32_Clock_Init(432, 25, 2, 9); 					//设置时钟,216Mhz
    delay_init(216);                					//延时初始化

    BSP_UartInit();              						//串口初始化
    BSP_LedInit();                     					//初始化LED
    BSP_KeyInit();                     					//初始化按键
    BSP_ExitInit();                    					//初始化外部中断
    BSP_SdramInit();                   					//初始化SDRAM
    BSP_LcdInit();                     					//初始化LCD
//	BSP_IicInit();										//初始化I2C  在触摸函数中调用
    BSP_TouchInit();				        			//触摸屏初始化

    BSP_RtcInit();										//初始化RTC实时时钟
    my_mem_init(SRAMIN);		    					//初始化内部内存池


	BSP_SdcardInit();									//SD卡初始化 在挂在SD卡中调用
#if(USE_Fatfs_File == 1)
    exfuns_init();										//为fatfs相关变量申请内存
    f_mount(fs[0],"0:",1); 								//挂载SD卡
#endif
    BSP_AdcInit();										//初始化ADC
    BSP_DacInit();					        			//初始化DAC

    BSP_TimChCapInit();             					//初始化定时器输入捕获
    BSP_TimPwmInit();									//初始化定时器PWM

    BSP_CanInit();										//初始化can

}


/******************* (C) COPYRIGHT 2015-2018 ENECO POWER********END OF FILE****/
