/*******************************************************************************
*                               APPLICATION CODE
*
* (c)Copyright Guangdong ENECO POWER Science And Technology Co., Ltd.2015-2018.
*
*      All rights reserved.  Protected by international copyright laws.
*       Knowledge of the source code may NOT be used without authorization.
********************************************************************************
*/


/**
 *******************************************************************************
 * @file      GUICONF.h
 * @author   GuanXianDe
 * @version   V1.0.0
 * @date      27-June-2018
 * @brief     Header for main.c module
 * @attention
 *******************************************************************************
**/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef GUICONF_H
#define GUICONF_H

#include "user_config.h"
/*
********************************************************************************
*                                 INCLUDE FILES
********************************************************************************
*/

/*
********************************************************************************
*                              EXPORTED DATA TYPES
********************************************************************************
*/
#if(USE_STemwin_File == 1)
#define GUI_NUM_LAYERS            1    //最大支持1层


#define GUI_OS                    (1)  // 使用操作系统
#define GUI_SUPPORT_TOUCH         (1)  // 支持触摸

#define GUI_DEFAULT_FONT          &GUI_Font6x8	//默认字体
#define GUI_SUPPORT_MOUSE         (1)    	//支持鼠标
#define GUI_WINSUPPORT            (1)    	//窗口管理
#define GUI_SUPPORT_MEMDEV        (1)    	//存储设备
#define GUI_SUPPORT_DEVICES       (1)    	//使用设备指针


/*
********************************************************************************
*                               EXPORTED CONSTANT
********************************************************************************
*/



/*
********************************************************************************
*                                EXPORTED MACRO
********************************************************************************
*/



/*
********************************************************************************
*                                   EXTERNS
********************************************************************************
*/


/*
********************************************************************************
*                              FUNCTION PROTOTYPES
********************************************************************************
*/

#endif

#endif /* _GUICONF_H */

/******************* (C) COPYRIGHT 2015-2018 ENECO POWER********END OF FILE****/




